tap "grishka/grishka"
tap "homebrew/bundle"
tap "homebrew/services"
tap "openresty/brew"
tap "wader/tap"
brew "openssl@3"
brew "python@3.12"
brew "adwaita-icon-theme"
brew "ant"
brew "jpeg-xl"
brew "aom"
brew "apktool"
brew "autoconf"
brew "automake"
brew "asdf"
brew "at-spi2-core"
brew "bat"
brew "broot"
brew "btop"
brew "cloc"
brew "cmake"
brew "cocoapods"
brew "cpufetch"
brew "curl"
brew "dex2jar"
brew "fd"
brew "unbound"
brew "gnutls"
brew "libmicrohttpd"
brew "ffmpeg"
brew "fossil"
brew "fzf"
brew "gawk"
brew "git"
brew "git-archive-all"
brew "git-lfs"
brew "go"
brew "gtk+3"
brew "grsync"
brew "highlight"
brew "htmlq"
brew "just"
brew "lf"
brew "vapoursynth"
brew "yt-dlp"
brew "mpv"
brew "openblas"
brew "numpy"
brew "ollama", restart_service: true
brew "onefetch"
brew "openvino"
brew "p7zip"
brew "postgresql@16"
brew "pyenv"
brew "python@3.11"
brew "ripgrep"
brew "rsync"
brew "rustup"
brew "sampler"
brew "scrcpy"
brew "sing-box"
brew "tealdeer"
brew "tokei"
brew "tree"
brew "trippy"
brew "unar"
brew "v8"
brew "wget"
brew "wtfutil"
brew "xmake"
brew "yadm"
brew "zoxide"
brew "openresty/brew/openresty"
brew "wader/tap/fq"
cask "apparency"
cask "applite"
cask "betterdisplay"
cask "beyond-compare"
cask "caffeine"
cask "clashx"
cask "cyberduck"
cask "db-browser-for-sqlite"
cask "drawio"
cask "dropshelf"
cask "easydict"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "fork"
cask "freeplane"
cask "gimp"
cask "google-chrome"
cask "hammerspoon"
cask "handbrake"
cask "iina"
cask "invisor-lite"
cask "jd-gui"
cask "joplin"
cask "karabiner-elements"
cask "keepassxc"
cask "keyboardcleantool"
cask "kitty"
cask "kodi"
cask "losslesscut"
cask "macvim"
cask "mediainfoex"
cask "motrix"
cask "neardrop"
cask "openemu"
cask "openra"
cask "openvanilla"
cask "pgadmin4"
cask "qladdict"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlvideo"
cask "quicklook-json"
cask "raycast"
cask "sloth"
cask "stats"
cask "steam"
cask "suspicious-package"
cask "syntax-highlight"
cask "visual-studio-code"
cask "vmware-fusion"
cask "warp"
cask "xemu"
cask "zed"
vscode "amazonwebservices.amazon-q-vscode"
vscode "bito.bito"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "nefrob.vscode-just-syntax"
vscode "rust-lang.rust-analyzer"
vscode "tboox.xmake-vscode"
vscode "vadimcn.vscode-lldb"
